# BuiltInFailures.SpanDirectionSymbolFailures Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SpanDirectionSymbolFailures Members
BuiltInFailures..::..SpanDirectionSymbolFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SpanDirectionSymbolFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NonPlanView | Span Direction Symbol can only be placed in a Floor Plan View. |

# See Also
BuiltInFailures..::..SpanDirectionSymbolFailures Class
Autodesk.Revit.DB Namespace